---
kind: property
id: P:Autodesk.Revit.DB.RenderingImageExposureSettings.Highlights
source: html/5196e99d-d5cf-6004-5793-de61748ab00d.htm
---
# Autodesk.Revit.DB.RenderingImageExposureSettings.Highlights Property

The highlights value.

## Syntax (C#)
```csharp
public double Highlights { get; set; }
```

## Remarks
Increase this value to get brighter highlights.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The value of highlights is not valid. The valid range is 0 to 1.